attacker/data/sio/spoofing/ab_results/ab_57.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        95 bytes

Concurrency Level:      10
Time taken for tests:   176.158 seconds
Complete requests:      20
Failed requests:        6
   (Connect: 0, Receive: 0, Length: 6, Exceptions: 0)
Keep-Alive requests:    20
Total transferred:      4844 bytes
HTML transferred:       1864 bytes
Requests per second:    0.11 [#/sec] (mean)
Time per request:       88079.045 [ms] (mean)
Time per request:       8807.905 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    5   4.7      8      10
Processing:    14 10300 27659.8   1524  112151
Waiting:       13 10300 27659.4   1524  112149
Total:         14 10305 27659.9   1534  112160

Percentage of the requests served within a certain time (ms)
  50%   1534
  66%   3242
  75%   3328
  80%   5379
  90%  62963
  95%  112160
  98%  112160
  99%  112160
 100%  112160 (longest request)
